/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_is_uint.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tkiselev <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/07/14 15:31:47 by tkiselev          #+#    #+#             */
/*   Updated: 2018/07/14 17:52:47 by tkiselev         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
 * Если встретили символ плюс или минус, то пропускаем
 * В цикле смотирм - пока читаем числа
 * Если число это большое, то возвр-ем ноль.
 * А дальше делаем атои, чтобы взять из строки цифры.
 * Возвращаем  единицу, если все числа прочли, и i > 0,
 * который говорит, что числа были найдены.
 * Иначе возв-ем нуль.
 */

char		ft_is_uint(char *str)
{
	int		res;
	int		i;

	if (!str)
		return (0);
	res = 0;
	i = 0;
	(str[0] == '-' || str[0] == '+') ? str++ : 0;
	while (str[i] >= '0' && str[i] <= '9')
	{
		if ((res == 429496729 && str[i] >= '6') || res > 429496730)
			return (0);
		res = res * 10 + str[i++] - '0';
	}
	return ((i > 0 && str[i] == '\0') ? 1 : 0);
}
